*** Data model

  A great place to start is always the data model. In Clojure we use specs for
  that. Lets start with the base attributes on our data model. NOTE: This is a
  simplified data model.

#+BEGIN_SRC clojure :tangle prod-app/src/prod_app/specs/attributes.clj :results silent
(ns prod-app.specs.attributes
  "This namespace contains attribute specs."
  (:require [clojure.string :as str]
            [clojure.spec.alpha :as s]
            [clojure.spec.gen.alpha :as gen] ))

(s/def :external/opportunity-id string?)
(s/def :external/trigger-id uuid?)

(s/def :loan-application/requested-amount string?)
(s/def :loan-application/loan-application-id uuid?)
(s/def :loan-application/tax-id 
  (s/with-gen #(re-matches #"[0-9]{10}" %)
    #(gen/return (str/join (map str (take 10 (repeatedly (fn [] (rand-int 10)))))))))
(s/def :loan-application/loan-application-is-complete boolean?)
(s/def :loan-application/problem string?)
(s/def :loan-application/problems
  (s/* :loan-application/problem))

(s/def :metadata/id uuid?)
(s/def :metadata/published-timestamp int?)
(s/def :metadata/published-by string?)

(s/def :sba-response/status #{"success" "failure" "cancelled"})
(s/def :sba-response/result string?)
(s/def :sba-response/loan-number (s/nilable string?))
#+END_SRC

  Now we define our reader specs. For this demo the only difference between an
  external and internal loan application is only ~loan-application-id~ being
  absent in the external one.

#+BEGIN_SRC clojure :tangle prod-app/src/prod_app/specs/reader_specs.clj :results silent
(ns prod-app.specs.reader-specs
  "Spec for reads from internal state and message streams.
  Use this spec for validation AFTER READING FROM INTERNAL STATE or
  reading messages from Kafka"
  (:require [clojure.spec.alpha :as s]
            [prod-app.specs.attributes]))

(s/def ::loan-application
  (s/keys :req-un [:external/opportunity-id
                   :loan-application/requested-amount
                   :loan-application/loan-application-id
                   :loan-application/tax-id]))

(s/def ::external-loan-application
  (s/keys :req-un [:external/opportunity-id
                   :loan-application/requested-amount
                   :loan-application/tax-id]))

(s/def ::external-trigger
  (s/keys :req-un [:external/opportunity-id
                   :external/trigger-id]))
#+END_SRC

  A loan application with invalid tax id.

#+begin_src clojure :tangle prod-app/dev/scratch.clj :exports both
(s/explain-data ::loan-application 
                {:loan-application-id (java.util.UUID/randomUUID)
                 :opportunity-id "external-id-for-a-loan"
                 :requested-amount "100"
                 :tax-id "foo"})
#+end_src

#+RESULTS:
: #:clojure.spec.alpha{:problems ({:path [:tax-id], :pred :clojure.spec.alpha/unknown, :val "foo", :via [:prod-app.specs.reader-specs/loan-application :loan-application/tax-id], :in [:tax-id]}), :spec :prod-app.specs.reader-specs/loan-application, :value {:loan-application-id #uuid "503d7ae5-aa4c-4074-a854-50493c7ee317", :opportunity-id "external-id-for-a-loan", :requested-amount "100", :tax-id "foo"}}

  A valid loan application entry in our state store.

#+begin_src clojure :tangle prod-app/dev/scratch.clj :results value :exports both
(s/valid? ::loan-application
          {:loan-application-id (java.util.UUID/randomUUID)
           :opportunity-id "external-id-for-a-loan"
           :requested-amount "100"
           :tax-id "1111111111"})
#+end_src

#+RESULTS:
: true

  This is what an ~external-trigger~ event looks like.

#+begin_src clojure :tangle prod-app/dev/scratch.clj :results value :exports both
(s/valid? ::external-trigger
          {:trigger-id (java.util.UUID/randomUUID)
           :opportunity-id "external-id-for-a-loan"})
#+end_src

#+RESULTS:
: true

  Writer specs are the specs we use to write to Kafka topics. This specs are
  usually less stringent as they only require the minimum data required for us
  consider a valid topic. For example notice how both reader and writer specs
  define ~::loan-application~. The reason for the difference is that when we write
  to the topic we are just aggregating data coming from the upstream external
  topics. The reader specs validate that a loan application is considered
  complete. Our topology will produce to ~sba-loan-updated-event~ with the right
  value for ~:loan-application/loan-application-is-complete~.

#+BEGIN_SRC clojure :tangle prod-app/src/prod_app/specs/writer_specs.clj :results silent
(ns prod-app.specs.writer-specs
  "Spec for writes to internal state and message streams.
  Use this spec for validation BEFORE WRITING TO INTERNAL STATE or publishing messages to Kafka."
  (:require [clojure.spec.alpha :as s]
            [prod-app.specs.attributes]))

(s/def ::loan-application
  (s/keys :req-un [:metadata/loan-application-id]
          :opt-un [:loan-application/requested-amount
                   :external/opportunity-id
                   :loan-application/tax-id]))

(s/def ::result
  (s/keys :req-un [:sba-response/status
                   :sba-response/result]
          :opt-un [:sba-response/loan-number]))

(s/def ::metadata
  (s/keys :req-un [:metadata/id
                   :metadata/published-timestamp
                   :metadata/published-by]))

(s/def ::sba-loan-application-updated-event
  (s/merge ::loan-application
           (s/keys :req-un [:loan-application/loan-application-is-complete])
           ::metadata
           (s/keys :req-un [:loan-application/problems])))

(s/def ::sba-result-available-event
  (s/merge ::result
           ::loan-application
           ::metadata))
#+END_SRC

  This is an example of an entry we expect on the ~sba-loan-application-updated-event~

#+begin_src clojure :tangle prod-app/dev/scratch.clj :results value :exports both
(s/valid? ::sba-loan-application-updated-event
          {:loan-application-id (java.util.UUID/randomUUID)
           :loan-application-is-complete true
           :problems []
           :opportunity-id "external-id-for-a-loan"
           :requested-amount "100"
           :tax-id "1111111111"
           :id (java.util.UUID/randomUUID)
           :published-timestamp 1
           :published-by "test"})
#+end_src

#+RESULTS:
: true

  This is an example of an entry we expect on the ~sba-result-available-event~

#+begin_src clojure :tangle prod-app/dev/scratch.clj :results value :exports both
(s/valid? ::sba-result-available-event
          {:loan-application-id (java.util.UUID/randomUUID)
           :opportunity-id "external-id-for-a-loan"
           :requested-amount "100"
           :tax-id "1111111111"
           :id (java.util.UUID/randomUUID)
           :published-timestamp 1
           :published-by "test"
           :status "success"
           :result ""
           :loan-number "123"})
#+end_src

#+RESULTS:
: true

** Testing the topology

  Lets implement a couple tests. This demo does not coitain full test coverage!
  In this tests we are going to validate one side of the topology. Notice how we
  use an atom to simulate our state store. The test requires very little setup.
  We simply need to ~transduce~ with our transformation fn we defined but that
  part of the topology. Neat!

#+BEGIN_SRC clojure :tangle prod-app/test/prod_app/topology_test.clj :results silent
(ns prod-app.topology-test
  (:require [clojure.test :refer [deftest is testing]]
            [clojure.edn :as edn]
            [clojure.spec.alpha :as s]
            [clojure.spec.gen.alpha :as gen]
            [prod-app.topology :as sc]
            [prod-app.log :as log]
            [prod-app.specs.reader-specs :as r-specs]
            [prod-app.specs.writer-specs :as w-specs]
            [metrics.core :as metrics]
            [metrics.meters :as meters]))

(defn gen-external-loan-app []
  (gen/generate (s/gen ::r-specs/loan-application)))

(defn metric-total [registry metric-name]
  (:total (meters/rates
           (meters/meter
            registry
            (log/->metric-name metric-name)))))

(deftest update-loan-application-test
  (testing "valid loan app"
    (let [state (atom {}) ;; yay transducers !!
          registry (metrics/new-registry)
          external-loan-application (gen-external-loan-app)
          opportunity-id (:opportunity-id external-loan-application)
          [[k v]] (transduce
                   (sc/update-loan-application state
                                               :swap-fn swap!
                                               :registry registry)
                   concat
                   [[opportunity-id external-loan-application]])]
      (is (= opportunity-id k) "output record key matches the opportunity-id")
      (is (s/valid? ::w-specs/sba-loan-application-updated-event v))
      (is (= opportunity-id (:opportunity-id v))
          "input opportunity-id matches the output opportunity-id")
      (is (= true (:loan-application-is-complete v))
          "loan application is set to complete")
      (is (nil? (not-empty (:problems v)))
          "problems are empty")
      (is (= 1 (metric-total registry "loan-application-complete")))))

  (testing "invalid loan app"
    (let [state (atom {})
          registry (metrics/new-registry)
          external-loan-application (dissoc (gen-external-loan-app)
                                            :tax-id)
          opportunity-id (:opportunity-id external-loan-application)
          [[_ v]] (transduce
                   (sc/update-loan-application state
                                               :swap-fn swap!
                                               :registry registry)
                   concat
                   [[opportunity-id external-loan-application]])]
      (is (= false (:loan-application-is-complete v))
          "loan application is set to incomplete")
      (is (not-empty (:problems v))
          "includes the problems")
      (is (= 1 (metric-total registry "loan-application-incomplete"))))))
#+END_SRC

  Ok lets run out tests.

#+begin_src clojure :ns clojure.test :tangle prod-app/dev/scratch.clj :results output :exports both
(run-tests 'prod-app.topology-test)
#+end_src

#+RESULTS:
: 
: Testing prod-app.topology-test
: 
: Ran 1 tests containing 9 assertions.
: 0 failures, 0 errors.


  We get nice, readable logs with our log configuration for tests. Notice the
  ~:wrap~ header argument on the following snippet.

#+BEGIN_SRC bash :dir prod-app :results output :wrap EXPORT json :exports both
tail -n 31 log/sba-connector-test.log 
#+END_SRC

#+RESULTS:
#+begin_EXPORT json
  "line" : 53,
  "opportunity-id" : "Y8vcTAKn2Hx5K3",
  "published-timestamp" : 1592784425178,
  "column" : 17,
  "requested-amount" : "1",
  "id" : "d5d779e2-8edf-584b-8243-1a587221b902",
  "event" : "sba-response-result",
  "tax-id" : "6126019115",
  "logger" : "prod-app.log",
  "message" : "SBA response result",
  "context" : "default"
}
{
  "timestamp" : "2020-06-22T00:07:05.925Z",
  "level" : "INFO",
  "thread" : "prod-app-StreamThread-5",
  "loan-application-id" : "548a46b0-fa61-58e8-9dbf-52f60e3c0280",
  "published-by" : "sba-connector",
  "ns" : "prod-app.log",
  "line" : 53,
  "opportunity-id" : "Y8vcTAKn2Hx5K3",
  "published-timestamp" : 1592784425178,
  "column" : 17,
  "requested-amount" : "1",
  "id" : "d5d779e2-8edf-584b-8243-1a587221b902",
  "event" : "sba-result-available-event",
  "tax-id" : "6126019115",
  "logger" : "prod-app.log",
  "message" : "SBA result available",
  "context" : "default"
}
#+end_EXPORT

** Integration tests

  Ok its time to showcase Test Machine. Test Machine is agnostic to the system
  is testing so it requires quite a bit of scaffolding to make it look nice
  running in your typical test setup. I think the name can be deceiving as Test
  Machine can be used in many contexts outside of the context of regular tests.
  It can also be used to programatically seed environments for example. I think
  some version of this scaffolding will be part of Jackdaw at some point. I've
  added this scaffolding namespaces directly to the generated project to avoid
  noise in this document but be sure to go check them out later.

#+begin_src clojure :tangle prod-app/dev/scratch.clj
(require '[prod-app.integration.fixtures]
         '[prod-app.integration.journal]
         '[prod-app.integration.runner])
#+end_src

#+RESULTS:
: nil

  Test Machine simulates Kafka via commands. The simplest way that I can explain
  it is as a machine that takes input commands and a topoloy configuration and
  spits out on the otherside a detailed log of what what happened on the other
  side of running all the commands given.

#+BEGIN_SRC clojure :tangle prod-app/test/prod_app/integration/topology_test.clj :results silent
(ns prod-app.integration.topology-test
  (:require
   [clojure.test :as t :refer [deftest is testing]]
   [clojure.spec.alpha :as s]
   [clojure.spec.gen.alpha :as gen]
   [jackdaw.test :as jd.test]
   [jackdaw.test.commands.watch :as watch]
   [metrics.core :as metrics]
   [prod-app.integration.runner :as test-runner]
   [prod-app.integration.journal :as journal]
   [prod-app.specs.reader-specs :as r-specs]
   [prod-app.specs.writer-specs :as w-specs]
   [prod-app.config :as config]
   [prod-app.specs.attributes]
   [prod-app.streams :as streams]
   [prod-app.topics :as topics]
   [prod-app.topic-metadata :as topic-metadata]))

(defn topology-under-test [tmd]
  (let [{:keys [config topology-builder topic-metadata xforms deref-fn get-fn swap-fn]}
        (assoc (::streams/topology config/sba-connector-app-state)
               :topic-metadata tmd)]
    (streams/build-topology config
                            topology-builder
                            topic-metadata
                            xforms
                            deref-fn
                            get-fn
                            swap-fn
                            (metrics/new-registry))))

(defn run-integration-test [mode commands assertions]
  (binding [watch/*default-watch-timeout* (if (= :mock mode) 1000 10000)]
    (let [tmd (topics/resolve-serdes (topic-metadata/build-topic-metadata 1 1) false)]
      (test-runner/run-test
       mode tmd (topology-under-test tmd)
       (fn [machine]
         ;; Run the test
         (let [{:keys [results journal]} (jd.test/run-test machine commands)]
           (is (test-runner/result-ok? results))
           (journal/summarise-and-export journal)
           (assertions journal)))))))

(defn mock-sba-endpoint [mock-responder]
  (fn [url post-body]
    (let [{:keys [headers body]} post-body]
      (is (= "application/json" (get headers "content-type")))
      (mock-responder body))))

(defmacro with-mock-sba-endpoint [[mock-responder] & body]
  `(with-redefs [clj-http.client/post (mock-sba-endpoint ~mock-responder)]
     ~@body))

(defn gen-external-loan-app []
  (gen/generate (s/gen ::r-specs/loan-application)))

(deftest integration-test
  (testing "SBA Builder"
    (doseq [[api-response loan-application-fn] [[{:status 200
                                                  :headers {"server" "da-government-box"}
                                                  :body
                                                  "{\"loan-number\": \"123\"}"}
                                                 gen-external-loan-app]]]
      (with-mock-sba-endpoint [(fn [req]
                                 api-response)]
        (let [loan-application (loan-application-fn)
              opportunity-id (:opportunity-id loan-application)]
          (run-integration-test
           :mock
           [[:write! :external-loan-application loan-application {:key opportunity-id}]
            [:watch (fn [j]
                      (let [ms (journal/messages j :sba-loan-application-updated)]
                        (> (count ms) 0)))]
            [:write!
             :external-trigger
             {:opportunity-id opportunity-id
              :trigger-id (java.util.UUID/randomUUID)}
             {:key opportunity-id}]
            [:watch (fn [j]
                      (let [ms (journal/messages j :sba-result-available)]
                        (> (count ms) 0)))]]
           (fn [j]
             (let [ms (journal/messages j :sba-result-available)
                   result (first ms)]
               (is (s/valid? ::w-specs/sba-result-available-event result))
               (is (= "123" (:loan-number result)))
               (is (= opportunity-id (:opportunity-id result)))))))))))

#+END_SRC 

#+begin_src clojure :ns clojure.test :tangle prod-app/dev/scratch.clj :results output :exports both
(run-tests 'prod-app.integration.topology-test)
#+end_src

#+RESULTS:
#+begin_example

Testing prod-app.integration.topology-test

|                        :topic | :messages |
|-------------------------------+-----------|
| :sba-loan-application-updated |         1 |
|         :sba-result-available |         1 |
writing results to './test-results/journal-1592784859616'

Ran 1 tests containing 5 assertions.
0 failures, 0 errors.
#+end_example

** Running our app

  Now lets see how to run this locally to showcase how this app would actually
  run in prod with a running Kafka. First we need an entrypoint.

#+begin_src clojure :tangle prod-app/src/prod_app/core.clj :results silent
(ns prod-app.core
  (:require [prod-app.config :as config]
            [integrant.core :as ig]))

;;  This hash-map will get filled in with data carrying stateful
;;  resources defined via integrant.
;;  After starting the services you can find the resources they
;;  provide under their defining keys.
(defonce app
  {})

(defn fresh-app
  [state]
  (def app (ig/init state)))

;; TODO: figure out a better way to do the main thats safe
(defn -main
  "Reloads config.
  Starts and binds the running app."
  []
  (fresh-app config/sba-connector-app-state))
#+end_src
  
  We need a runtime environment to run our example. For that we'll rely on
  docker-compose.

#+begin_src yaml :tangle prod-app/docker-compose.yml :eval no
---
version: '2'
services:
  zookeeper:
    image: confluentinc/cp-zookeeper:5.5.0
    hostname: zookeeper
    container_name: zookeeper
    ports:
      - "2181:2181"
    environment:
      ZOOKEEPER_CLIENT_PORT: 2181
      ZOOKEEPER_TICK_TIME: 2000

  broker:
    image: confluentinc/cp-kafka:5.5.0
    hostname: broker
    container_name: broker
    depends_on:
      - zookeeper
    ports:
      - "29092:29092"
      - "9092:9092"
    environment:
      KAFKA_BROKER_ID: 1
      KAFKA_ZOOKEEPER_CONNECT: 'zookeeper:2181'
      KAFKA_LISTENER_SECURITY_PROTOCOL_MAP: PLAINTEXT:PLAINTEXT,PLAINTEXT_HOST:PLAINTEXT
      KAFKA_ADVERTISED_LISTENERS: PLAINTEXT://broker:29092,PLAINTEXT_HOST://localhost:9092
      KAFKA_OFFSETS_TOPIC_REPLICATION_FACTOR: 1
      KAFKA_TRANSACTION_STATE_LOG_MIN_ISR: 1
      KAFKA_TRANSACTION_STATE_LOG_REPLICATION_FACTOR: 1
      KAFKA_GROUP_INITIAL_REBALANCE_DELAY_MS: 0

  schema-registry:
    image: confluentinc/cp-schema-registry:5.5.0
    hostname: schema-registry
    container_name: schema-registry
    depends_on:
      - zookeeper
      - broker
    ports:
      - "8081:8081"
    environment:
      SCHEMA_REGISTRY_HOST_NAME: schema-registry
      SCHEMA_REGISTRY_KAFKASTORE_CONNECTION_URL: 'zookeeper:2181'
#+end_src

  Now we can define a "slow" and manual end to end test for our topology running
  on Kafka environment. This also helps us understand what kind of setup our app
  woulr need in production. Be patient :P

#+BEGIN_SRC bash :dir prod-app :tangle prod-app/bin/end-to-end.bash :results pp :exports both
#!/usr/bin/bash
echo "clear the logs"
rm log/sba-connector-test.log

echo "resetting the runtime"
docker-compose down -v
docker-compose up -d schema-registry

echo "waiting for schema registry up"
sleep 10

echo "running our topology"
clojure -C:test -m prod-app.core &
echo "registering external schemas"
echo '{"schema": ""}' | jq --rawfile foo resources/schemas/external-trigger.json '. |= {schema: $foo, schemaType: "AVRO"}' | curl -X POST -H "Content-Type: application/json" http://localhost:8081/subjects/external-trigger-1-value/versions -d @-
echo '{"schema": ""}' | jq --rawfile foo resources/schemas/external-loan-application.json '. |= {schema: $foo, schemaType: "AVRO"}' | curl -X POST -H "Content-Type: application/json" http://localhost:8081/subjects/external-loan-application-1-value/versions -d @-


echo "producing external loan application"
{
  eval docker-compose exec -T schema-registry kafka-avro-console-producer \
       --bootstrap-server broker:29092 \
       --topic external-loan-application-1 \
       --property value.schema=\'$(cat resources/schemas/external-loan-application.json)\' \
       --property parse.key=true \
       --property key.schema=\'$(echo '{"type":"string"}')\' \
       --property key.separator=\" \" \
       <<< '"Y8vcTAKn2Hx5K3" {"opportunity_id": {"string": "Y8vcTAKn2Hx5K3"}, "requested_amount": {"string": "1"}, "loan_application_id": {"string": "0b62206c-d244-4a4f-80ce-daa164934b53"}, "tax_id": {"string": "6126019115"}}' 
} &> /dev/null # supresess the super verbose utility

echo "producing a trigger"
{
  eval docker-compose exec -T schema-registry kafka-avro-console-producer \
    --bootstrap-server broker:29092 \
    --topic external-trigger-1 \
    --property value.schema=\'$(cat resources/schemas/external-trigger.json)\' \
    --property parse.key=true \
    --property key.schema=\'$(echo '{"type":"string"}')\' \
    --property key.separator=\" \" \
    <<< '"Y8vcTAKn2Hx5K3" {"opportunity_id": {"string": "Y8vcTAKn2Hx5K3"}, "trigger_id": {"string": "7d7c6ca4-71e0-4228-a231-6a5449a864e7"}}' 
} &> /dev/null # surpreses the super verbose utility
echo "Wait for records to be processed"
sleep 10
pkill -P $$
echo "Done"
#+END_SRC

#+RESULTS:
: clear the logs
: resetting the runtime
: waiting for schema registry up
: running our topology
: registering external schemas
: {"id":1}{"id":2}producing external loan application
: producing a trigger
: Wait for records to be processed
: Done

  After the run we can see the topics that were created by our topology

#+BEGIN_SRC bash :dir prod-app
docker-compose exec -T broker kafka-topics --list --bootstrap-server localhost:9092
#+END_SRC

#+RESULTS:
| __confluent.support.metrics           |
| __consumer_offsets                    |
| __transaction_state                   |
| _schemas                              |
| external-loan-application-1           |
| external-trigger-1                    |
| sba-connector-streams-state-changelog |
| sba-loan-application-updated-1        |
| sba-result-available-1                |

  The internal schemas where defined by the topology when it was writing to
  them. The external ones we had to create manually in the script above.

#+BEGIN_SRC bash :dir prod-app
curl http://localhost:8081/subjects | jq .
#+END_SRC

#+RESULTS:
| [                                    |
| external-loan-application-1-value    |
| sba-loan-application-updated-1-value |
| external-trigger-1-key               |
| external-trigger-1-value             |
| external-loan-application-1-key      |
| sba-result-available-1-value         |
| ]                                    |

  We can peek at our logs and we see that a sba result was published.

#+BEGIN_SRC bash :dir prod-app :results output :wrap EXPORT json :exports both
tail -n 19 log/sba-connector-test.log
#+END_SRC

#+RESULTS:
#+begin_EXPORT json
{
  "timestamp" : "2020-06-22T00:14:47.412Z",
  "level" : "INFO",
  "thread" : "prod-app-StreamThread-5",
  "loan-application-id" : "548a46b0-fa61-58e8-9dbf-52f60e3c0280",
  "published-by" : "sba-connector",
  "ns" : "prod-app.log",
  "line" : 53,
  "opportunity-id" : "Y8vcTAKn2Hx5K3",
  "published-timestamp" : 1592784886563,
  "column" : 17,
  "requested-amount" : "1",
  "id" : "d5d779e2-8edf-584b-8243-1a587221b902",
  "event" : "sba-result-available-event",
  "tax-id" : "6126019115",
  "logger" : "prod-app.log",
  "message" : "SBA result available",
  "context" : "default"
}
#+end_EXPORT

  We can also validate the content of our topics. Use ~kafkacat~ for consuming
  from kafka topic. Its way better than the ~kafka-console-consumor~ and it
  recently added support for AVRO

 #+BEGIN_SRC bash :dir prod-app :results output :wrap EXPORT json :exports both
docker run --tty \
  --network host \
  edenhill/kafkacat:1.5.0 \
  kafkacat -e -q  -b localhost:9092 \
  -s avro -r http://localhost:8081 \
  -t sba-loan-application-updated-1 | jq .
#+END_SRC

#+RESULTS:
#+begin_EXPORT json
{
  "loan_application_id": {
    "string": "548a46b0-fa61-58e8-9dbf-52f60e3c0280"
  },
  "opportunity_id": {
    "string": "Y8vcTAKn2Hx5K3"
  },
  "requested_amount": {
    "string": "1"
  },
  "tax_id": {
    "string": "6126019115"
  },
  "id": {
    "string": "548a46b0-fa61-58e8-9dbf-52f60e3c0280"
  },
  "published_timestamp": {
    "long": 1592784886362
  },
  "published_by": {
    "string": "sba-connector"
  },
  "loan_application_is_complete": {
    "boolean": true
  },
  "problems": {
    "array": []
  }
}
#+end_EXPORT

#+BEGIN_SRC bash :dir prod-app :results output :wrap EXPORT json :exports both
docker run --tty \
  --network host \
  edenhill/kafkacat:1.5.0 \
  kafkacat -e -q  -b localhost:9092 \
  -s avro -r http://localhost:8081 \
  -t sba-result-available-1 | jq .
#+END_SRC

#+RESULTS:
#+begin_EXPORT json
{
  "id": {
    "string": "d5d779e2-8edf-584b-8243-1a587221b902"
  },
  "status": {
    "string": "success"
  },
  "result": {
    "string": "{\"loan-number\":\"123\"}"
  },
  "loan_number": {
    "string": "123"
  },
  "loan_application_id": {
    "string": "548a46b0-fa61-58e8-9dbf-52f60e3c0280"
  },
  "requested_amount": {
    "string": "1"
  },
  "tax_id": {
    "string": "6126019115"
  },
  "published_timestamp": {
    "long": 1592784886563
  },
  "published_by": {
    "string": "sba-connector"
  },
  "opportunity_id": {
    "string": "Y8vcTAKn2Hx5K3"
  }
}
#+end_EXPORT

  We can even inspect our state store backing topic created by Kafka Streams.
  Notice that the data in the backing state store is plain EDN :D

#+BEGIN_SRC bash :dir prod-app :results output :wrap EXPORT clojure :exports both
docker run --tty \
  --network host \
  edenhill/kafkacat:1.5.0 \
  kafkacat -e -q -b localhost:9092  \
  -t sba-connector-streams-state-changelog
#+END_SRC

#+RESULTS:
#+begin_EXPORT clojure
{:loan-application-id #uuid "548a46b0-fa61-58e8-9dbf-52f60e3c0280", :opportunity-id "Y8vcTAKn2Hx5K3", :requested-amount "1", :tax-id "6126019115"}
#+end_EXPORT
